{
  "6-7": [
    {
      "title": "The Vanishing Cupcake",
      "mystery": "Emma left her cupcake on the table, but when she came back, only the wrapper was there. What happened?",
      "solution": "Her dog ate the cupcake while she was gone.",
      "solution_variants": [
        "Her dog ate the cupcake.",
        "Her dog snuck the cupcake and ate it.",
        "The cupcake disappeared because the dog got to it.",
        "While she was away, the dog finished the cupcake."
      ],
      "hint": "Was there a furry suspect nearby?"
    },
    {
      "title": "The Jumping Shoes",
      "mystery": "Liam’s sneakers were in the middle of the yard, even though he left them by the door. How?",
      "solution": "His brother used them as 'goalposts' for soccer.",
      "solution_variants": [
        "His brother used them as 'goal' for football.",
        "His sibling moved the shoes to play soccer with them.",
        "The shoes were used as goal markers by his younger sibling.",
        "The little brother set up the shoes as part of a game."
      ],
      "hint": "Think about a game outside."
    },
    {
      "title": "The Invisible Drawings",
      "mystery": "Sophie drew a picture with her new pen, but later the page looked blank. Why?",
      "solution": "She used disappearing ink.",
      "solution_variants": [
        "She used disappearing ink.",
        "The pen’s ink got transparent after a while.",
        "She drew with ink that disappears over time.",
        "The ink used was special and invisible later."
      ],
      "hint": "This pen was a little magical."
    },
    {
      "title": "The Talking Teddy",
      "mystery": "Ben’s teddy bear spoke while he was in the kitchen. How?",
      "solution": "His walkie-talkie was hidden inside the teddy.",
      "solution_variants": [
        "His walkie-talkie was hidden inside the teddy.",
        "A walkie talkie inside the teddy made it talk.",
        "The teddy had a walkie-talkie placed inside it.",
        "The sound came from a walkie-talkie hidden in the bear."
      ],
      "hint": "Was there another device inside?"
    },
    {
      "title": "The Upside-Down Painting",
      "mystery": "The picture in the hallway was upside down, but no one admitted touching it. Why?",
      "solution": "The cat knocked it over and it was rehung the wrong way.",
      "solution_variants": [
        "A cat knocked over the picture and someone hung it upside down.",
        "The cat made the picture fall and it was put back upside down.",
        "A cat tipped it over and it was re-hung incorrectly.",
        "The picture fell because of the cat and got put back upside down."
      ],
      "hint": "Who in the house might knock things over?"
    },
    {
      "title": "The Backwards Clock",
      "mystery": "At school, the clock on the wall was ticking backwards. Why?",
      "solution": "Someone recorded it on a phone and played the video in reverse.",
      "solution_variants": [
        "Someone recorded it on a phone and played the video in reverse.",
        "It was a video of the clock played backwards.",
        "The clock appeared reversed because it was on a video loop.",
        "A recording was shown backwards to make the clock seem reversed."
      ],
      "hint": "Was it actually the real clock you saw?"
    },
    {
      "title": "The Melted Snowman",
      "mystery": "There was a puddle on the porch with a carrot and a scarf in it. What happened?",
      "solution": "It was a snowman that melted in the sun.",
      "solution_variants": [
        "It was a snowman that melted in the sun.",
        "The snowman melted.",
        "The snow melted, leaving only the carrot and scarf.",
        "The sun caused the snowman to disappear into water."
      ],
      "hint": "What happens to snow in warm weather?"
    },
    {
      "title": "The Bag of Sand",
      "mystery": "Ella’s backpack was much heavier after recess. Why?",
      "solution": "Her friends secretly filled it with sandbox sand as a prank.",
      "solution_variants": [
        "Her friends secretly filled it with sandbox sand as a prank.",
        "Someone added sand to her bag while she wasn’t looking.",
        "Her friends poured sand inside her backpack for fun.",
        "The bag was filled with sand from the sandbox."
      ],
      "hint": "Did anyone play a trick on her?"
    },
    {
      "title": "The Floating Apple",
      "mystery": "An apple floated in Mia’s sink without touching the sides. How?",
      "solution": "The sink was full of water.",
      "solution_variants": [
        "The sink was full of water.",
        "The apple was floating because the sink had water in it.",
        "The sink had water, which made the apple float.",
        "Water in the sink kept the apple from sinking."
      ],
      "hint": "What makes some things float?"
    },
    {
      "title": "The Sticky Door Handle",
      "mystery": "The kitchen door handle was sticky, but no food was nearby. Why?",
      "solution": "Someone had honey on their hands from breakfast.",
      "solution_variants": [
        "Someone had honey on their hands from breakfast.",
        "The stickiness came from honey left on someone’s hands.",
        "Honey on someone’s fingers made the handle sticky.",
        "Someone touched the handle after eating honey."
      ],
      "hint": "Think of a sticky breakfast food."
    }
  ],
  "8-9": [
    {
      "title": "The Disappearing Sandwich",
      "mystery": "Kai’s lunchbox was zipped shut, but his sandwich was gone. How?",
      "solution": "A raccoon opened it while his bag was outside.",
      "solution_variants": [
        "A raccoon opened it while his bag was outside.",
        "His sandwich was taken by a raccoon outside.",
        "A raccoon got into his lunchbox when it was outside.",
        "While outside, a raccoon opened the lunchbox and took the sandwich."
      ],
      "hint": "It wasn’t a human thief."
    },
    {
      "title": "The Glow in the Closet",
      "mystery": "Zara saw a strange green glow from her closet at night. Why?",
      "solution": "Her glow-in-the-dark toy was sitting on a shelf.",
      "solution_variants": [
        "Her glow-in-the-dark toy was sitting on a shelf.",
        "The toy that glows in the dark was on a closet shelf.",
        "A glowing toy inside the closet caused the light.",
        "The closet light was from her glow-in-the-dark toy."
      ],
      "hint": "Think about something that shines without electricity."
    },
    {
      "title": "The Locked Phone Case",
      "mystery": "No one could open Max’s phone case, even though it wasn’t locked. Why?",
      "solution": "It had melted slightly in the sun and got stuck.",
      "solution_variants": [
        "It had melted slightly in the sun and got stuck.",
        "The phone case melted a bit in the sun and wouldn’t open.",
        "Sun heat caused the case to warp and stick shut.",
        "The sun melted the phone case, making it stuck."
      ],
      "hint": "Heat can change things."
    },
    {
      "title": "The Paper Snowstorm",
      "mystery": "Paper scraps covered the floor, but no one was cutting anything. Why?",
      "solution": "The shredder turned on when the cat stepped on the button.",
      "solution_variants": [
        "The shredder turned on when the cat stepped on the button.",
        "The cat accidentally activated the shredder.",
        "A cat triggered the shredder causing paper scraps.",
        "Paper was shredded because the cat pressed the button."
      ],
      "hint": "Could a machine have done it?"
    },
    {
      "title": "The Mystery Footprints",
      "mystery": "Tiny muddy footprints appeared on the kitchen counter. How?",
      "solution": "The kitten walked through a plant pot and jumped up.",
      "solution_variants": [
        "The kitten walked through a plant pot and jumped up.",
        "A kitten with muddy paws jumped onto the counter.",
        "Tiny footprints are from the muddy kitten’s jump.",
        "The muddy kitten left footprints on the kitchen counter."
      ],
      "hint": "Who in the house is small and likes to jump?"
    },
    {
      "title": "The Cold Pillow",
      "mystery": "When Leo went to bed, his pillow was icy cold. Why?",
      "solution": "His sister put it in the freezer as a prank.",
      "solution_variants": [
        "His sister put it in the freezer as a prank.",
        "The pillow was frozen by his sister as a joke.",
        "She left the pillow in the freezer to prank him.",
        "The pillow was icy because it had been in the freezer."
      ],
      "hint": "It wasn’t outside, but it was very cold."
    },
    {
      "title": "The Vanishing Homework",
      "mystery": "Maya’s homework disappeared from her desk. Where did it go?",
      "solution": "Her dog dragged it under the couch.",
      "solution_variants": [
        "Her dog dragged it under the couch.",
        "The homework was pulled under the couch by her dog.",
        "Her dog took the homework and hid it under the couch.",
        "The dog took the homework and hid it beneath the couch."
      ],
      "hint": "Did anyone furry visit?"
    },
    {
      "title": "The Singing Plant",
      "mystery": "A plant seemed to be singing a tune. What’s the trick?",
      "solution": "A small speaker was hidden in the pot.",
      "solution_variants": [
        "A small speaker was hidden in the pot.",
        "There was a speaker inside the plant pot playing music.",
        "The singing came from a speaker hidden in the pot.",
        "Music was played from a speaker inside the plant pot."
      ],
      "hint": "Is the plant really singing?"
    },
    {
      "title": "The Spilled Paint",
      "mystery": "There was blue paint on the floor, but no one was painting. How?",
      "solution": "The wind blew over an open paint can on the porch.",
      "solution_variants": [
        "The wind blew over an open paint can on the porch.",
        "An open paint can was knocked over by the wind.",
        "The wind caused the paint to spill from the can.",
        "Paint spilled on the floor because wind tipped the can."
      ],
      "hint": "Was the door or window open?"
    }
  ],
  "10-12": [
    {
      "title": "The Missing Book",
      "mystery": "Oliver’s favorite book disappeared from his shelf overnight. Where was it?",
      "solution": "His younger sibling hid it to surprise him.",
      "solution_variants": [
        "His younger sibling hid it to surprise him.",
        "The book was hidden by his younger sibling as a prank.",
        "His sibling took the book to surprise him later.",
        "The missing book was hidden by his younger brother or sister."
      ],
      "hint": "Who might want to surprise or tease him?"
    },
    {
      "title": "The Broken Vase",
      "mystery": "The vase was shattered, but no one saw anything. What happened?",
      "solution": "The cat knocked it off the table.",
      "solution_variants": [
        "The cat knocked it off the table.",
        "A cat caused the vase to fall and break.",
        "The vase broke because the cat pushed it off.",
        "It was broken after the cat knocked it over."
      ],
      "hint": "Look for the pet culprit."
    },
    {
      "title": "The Locked Diary",
      "mystery": "Sophie’s diary was locked, but the lock wasn’t on. How was it secure?",
      "solution": "She used a secret code to hide the pages.",
      "solution_variants": [
        "She used a secret code to hide the pages.",
        "The diary pages were secured with a secret code.",
        "She wrote in a secret code to keep it safe.",
        "A secret code was used to protect the diary entries."
      ],
      "hint": "Think about secret writing."
    },
    {
      "title": "The Vanishing Cookies",
      "mystery": "Cookies disappeared from the jar even though the lid was tight. Why?",
      "solution": "The jar had a small hidden opening at the bottom.",
      "solution_variants": [
        "The jar had a small hidden opening at the bottom.",
        "Cookies escaped through a secret hole in the jar.",
        "A tiny opening at the jar’s bottom let cookies out.",
        "The jar’s secret opening caused cookies to vanish."
      ],
      "hint": "Was there a secret passage?"
    },
    {
      "title": "The Shadow on the Wall",
      "mystery": "A shadow moved on the wall, but no one was there. Why?",
      "solution": "A spinning mobile toy cast moving shadows.",
      "solution_variants": [
        "A spinning mobile toy cast moving shadows.",
        "Moving shadows were from a spinning mobile toy.",
        "The mobile toy’s motion caused shadows to move.",
        "Shadows moved because of a spinning hanging toy."
      ],
      "hint": "What can cast shadows but isn’t a person?"
    },
    {
      "title": "The Mystery Whistle",
      "mystery": "A whistle blew in the empty room. What caused it?",
      "solution": "A draft made a loose window flap whistle.",
      "solution_variants": [
        "A draft made a loose window flap whistle.",
        "The whistle sound came from a draft through a window.",
        "Wind caused a window flap to whistle.",
        "A loose window flap whistled because of the wind."
      ],
      "hint": "Wind can make surprising noises."
    },
    {
      "title": "The Glowing Necklace",
      "mystery": "A necklace glowed softly at night. Why?",
      "solution": "It had tiny glow-in-the-dark beads.",
      "solution_variants": [
        "It had tiny glow-in-the-dark beads.",
        "The necklace shone because of glow beads.",
        "Small glow beads made the necklace light up.",
        "The necklace glowed due to glow-in-the-dark beads."
      ],
      "hint": "Some jewelry shines in the dark."
    },
    {
      "title": "The Broken Laptop",
      "mystery": "The laptop wouldn’t turn on, but it was plugged in. What happened?",
      "solution": "The power cord was damaged inside the plug.",
      "solution_variants": [
        "The power cord was damaged inside the plug.",
        "Inside the plug, the power cord was broken.",
        "The laptop’s plug had a broken power cord.",
        "A damaged power cord inside the plug caused the problem."
      ],
      "hint": "Check the plug carefully."
    },
    {
      "title": "The Moving Chair",
      "mystery": "A chair was moved from the kitchen to the living room without anyone touching it. How?",
      "solution": "The floor was sloped, causing the chair to roll.",
      "solution_variants": [
        "The floor was sloped, causing the chair to roll.",
        "A sloped floor made the chair move on its own.",
        "The chair rolled because the floor wasn’t level.",
        "Uneven flooring caused the chair to move by itself."
      ],
      "hint": "Is the floor even?"
    }
  ]
}